# brew bundle

# macOS Apps
brew "mas"
cask "1password"
# cask "cloudflare-warp"
cask "discord"
cask "gimp"
cask "lulu"
cask "rectangle"
cask "signal"
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959

# Web Browsers
cask "brave-browser"
cask "firefox"
cask "google-chrome"

# Cloud / AWS
brew "aws-vault"
brew "awscli"
tap "hashicorp/tap"
brew "hashicorp/tap/terraform"
brew "tflint"
cask "sentinel"

# Shell / CLI Tools
# brew "curl"
# brew "direnv"
brew "fx"
# brew "gh"
# brew "gnupg"
brew "jless"
brew "jq"
# brew "tmux"
# brew "wget"
# brew "xz"
brew "ykman"
brew "yq"
cask "1password-cli"

# Docker / k8s
brew "podman"
cask "podman-desktop"
brew "docker-compose"
brew "helm"
brew "k9s"
brew "kind"
brew "kubernetes-cli"
# cask "kui"

# Dev
cask "visual-studio-code"
# brew "go"
# brew "node"
# brew "nvm"
# brew "rbenv"
# brew "ruby-build"
# brew "ruby"
# brew "sqlfluff"
# brew "watchman"

# AI
cask "ollama"

# VS Code extensions
vscode "continue.continue"
vscode "davidanson.vscode-markdownlint" # from "docsmsft.docs-authoring-pack"
vscode "dbaeumer.vscode-eslint"
vscode "docsmsft.docs-article-templates"
vscode "docsmsft.docs-markdown"
vscode "docsmsft.docs-preview"
vscode "docsmsft.docs-scaffolding"
vscode "docsmsft.docs-yaml"
vscode "eamodio.gitlens"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hashicorp.hcl"
vscode "hashicorp.sentinel"
vscode "hashicorp.terraform"
vscode "ibm.output-colorizer"
# vscode "mongodb.mongodb-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.kind-vscode"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-ossdata.vscode-postgresql"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "msjsdiag.vscode-react-native"
vscode "redhat.ansible"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"

# Keyboard / QMK / VIA
# cask "via"

# Lab / Virtualization
cask "utm" if Hardware::CPU.intel?
# cask "multipass" if Hardware::CPU.intel?
# cask "virtualbox" if Hardware::CPU.intel?
