# brew bundle

# macOS Apps
cask "1password"
# cask "cloudflare-warp"
cask "rectangle"

# Web Browsers
cask "brave-browser"
cask "firefox"
cask "google-chrome"

# Cloud / AWS
brew "aws-vault"
brew "awscli"
brew "terraform"
brew "tflint"
brew "sentinel"

# Shell / CLI Tools
brew "curl"
brew "gnupg"
brew "jq"
brew "tmux"
brew "wget"
brew "xz"
brew "ykman"
brew "yq"

# Docker / k8s
cask "docker"
brew "docker-compose"
brew "helm"
brew "k9s"
brew "kind"
brew "kubernetes-cli", args: ["overwrite"]

# Dev
cask "visual-studio-code"
brew "go"
brew "node"
brew "nvm"
brew "rbenv"
brew "ruby-build"
brew "ruby"
brew "sqlfluff"
brew "watchman"

# VS Code extensions
vscode "docsmsft.docs-authoring-pack"
vscode "docsmsft.docs-build"
vscode "docsmsft.docs-images"
vscode "docsmsft.docs-linting"
vscode "docsmsft.docs-markdown"
vscode "docsmsft.docs-metadata"
vscode "docsmsft.docs-preview"
vscode "docsmsft.docs-scaffolding"
vscode "docsmsft.docs-yaml"
vscode "golang.go"
vscode "Gruntfuggly.todo-tree"
vscode "hashicorp.hcl"
vscode "hashicorp.sentinel"
vscode "hashicorp.terraform"
vscode "IBM.output-colorizer"
vscode "johnpapa.vscode-peacock"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.kind-vscode"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-ossdata.vscode-postgresql"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.makefile-tools"
vscode "msjsdiag.vscode-react-native"
vscode "oderwat.indent-rainbow"
vscode "redhat.ansible"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"

# Keyboard / QMK / VIA
cask "via"

# Lab / Virtualization
cask "multipass" if Hardware::CPU.intel?
cask "virtualbox" if Hardware::CPU.intel?
